window.ITEM_KO = [
  { id: 1548066885, ko: '확장 탄창', desc: '', slot: 'weapon', tier: 1 },
  { id: 1009965641, ko: '괴수탄', desc: '', slot: 'weapon', tier: 1 },
  {
    id: 709540378,
    ko: '희생 제물',
    desc: '대상 적군 NPC를 섭취해 170%의 보너스 영혼 및 오래 지속되는 강력한 강화 효과를 얻습니다.',
    slot: 'weapon',
    tier: 3
  },
  {
    id: 811521119,
    ko: '전류탄',
    desc: '대상이 총탄에 맞으면 일정 확률로 대상에 전기 충격 피해를 입힙니다. 전기 충격은 근처 적군에게 연쇄 피해를 입힙니다.',
    slot: 'weapon',
    tier: 3
  },
  {
    id: 710436191,
    ko: '축전기',
    desc: '피해를 입히는 투사체를 발사해 시간이 지남에 따라 회복되는 강력한 둔화 효과를 적용하고, 활력 사용을 막고, 이동 기반 아이템과 능력에 침묵을 적용합니다.',
    slot: 'weapon',
    tier: 4
  },
  {
    id: 2678489038,
    ko: '중공탄',
    desc: '자신의 체력이 65% 이상일 경우, 추가 무기 피해를 입히며 총탄에 맞은 적군의 총탄 저항이 감소합니다.',
    slot: 'weapon',
    tier: 3
  },
  {
    id: 2064029594,
    ko: '개방탄',
    desc: '체력이 50% 이상인 적군에게 추가 무기 피해를 입힙니다.',
    slot: 'weapon',
    tier: 2
  },
  { id: 3077079169, ko: '고속탄', desc: '', slot: 'weapon', tier: 1 },
  {
    id: 1437614329,
    ko: '근거리 공격 체력 흡수',
    desc: '다음 근거리 공격 시 자신을 치유합니다. 비영웅 상대 시 전체 치유량의 30%를 치유합니다.약한 근거리 공격이 적중하면 쿨다운이 1.5배로 증가합니다.',
    slot: 'vitality',
    tier: 1
  },
  {
    id: 4204808176,
    ko: '반격',
    desc: '적군 영웅을 상대로 방어에 성공하면 방어한 피해만큼 자신을 치유하고 해당 피해를 대상에게 돌려줍니다. 또한 일시적으로 피해가 증가합니다.',
    slot: 'vitality',
    tier: 1
  },
  {
    id: 1414025773,
    ko: '마법 방어',
    desc: '다음 방어가 적군의 능력과 아이템이 입히는 피해와 효과로부터 보호해 줍니다. 주문 방어에 성공하면 치유하고, 이동 속도와 마력을 얻습니다.',
    slot: 'vitality',
    tier: 3
  },
  {
    id: 3791587546,
    ko: '중량탄',
    desc: '적군이 총탄에 맞으면 효과가 축적되어 이동 속도가 둔화됩니다.',
    slot: 'weapon',
    tier: 3
  },
  {
    id: 1342610602,
    ko: '클로즈 쿼터',
    desc: '근거리에 있는 대상에 추가 무기 피해를 입힙니다.',
    slot: 'weapon',
    tier: 1
  },
  {
    id: 3331811235,
    ko: '장거리 사격',
    desc: '대상과의 거리가 최소 거리 이상이면 추가 무기 피해를 입힙니다.',
    slot: 'weapon',
    tier: 2
  },
  {
    id: 393974127,
    ko: '둔화탄',
    desc: '적군이 총탄에 맞으면 효과가 축적되다 이동 속도가 둔화됩니다.',
    slot: 'weapon',
    tier: 2
  },
  {
    id: 2037039379,
    ko: '억제탄',
    desc: '대상이 총탄에 맞으면 효과가 축적되어, 대상이 입히는 피해가 감소하고 대상에게 치유 감소 효과를 적용합니다.',
    slot: 'vitality',
    tier: 4
  },
  {
    id: 1144549437,
    ko: '마법 분쇄',
    desc: '대상이 총탄에 맞으면 대상의 마법 저항이 감소하는 약화 효과를 적용하고 자신과 아군에게 해당 대상에 대한 마법 체력 흡수 효과가 부여됩니다.',
    slot: 'weapon',
    tier: 2
  },
  { id: 2108215830, ko: '영웅의 오라', desc: '근처 아군 유닛에게 총탄 저항을 부여합니다.', slot: 'weapon', tier: 3 },
  {
    id: 619484391,
    ko: '침묵파',
    desc: '점차 커지는 투사체를 발사해 적군에게 잠시 동안 침묵을 적용하고 충격 피해를 입힙니다. 침묵은 능력 집중을 방해하지 않습니다.',
    slot: 'spirit',
    tier: 3
  },
  {
    id: 1113837674,
    ko: '침묵탄',
    desc: '대상이 총탄에 맞으면 효과가 축적되다 침묵에 걸립니다. 침묵에 걸린 대상은 침묵이 만료된 후 10초 동안 축적에 면역됩니다.',
    slot: 'weapon',
    tier: 4
  },
  { id: 1414319208, ko: '광전사', desc: '지속 피해가 중첩될 때마다 무기 피해가 증가합니다.', slot: 'weapon', tier: 3 },
  { id: 339443430, ko: '광란', desc: '', slot: 'weapon', tier: 4 },
  { id: 1282141666, ko: '흡수탄', desc: '', slot: 'vitality', tier: 4 },
  {
    id: 2010028405,
    ko: '헤드샷 부스터',
    desc: '적군 영웅을 대상으로 하는 다음 헤드샷이 보너스 무기 피해를 입힙니다.',
    slot: 'weapon',
    tier: 1
  },
  { id: 1770441818, ko: '감쇠 헤드샷', desc: '헤드샷 명중 시 총탄 저항을 감소시킵니다.', slot: 'weapon', tier: 2 },
  {
    id: 2152872419,
    ko: '명중 사격',
    desc: '대상과의 거리가 최소 거리 이상이면 추가 무기 피해를 입힙니다.',
    slot: 'weapon',
    tier: 3
  },
  {
    id: 4053935515,
    ko: '헤드헌터',
    desc: '적군 영웅을 대상으로 하는 다음 헤드샷이 보너스 무기 피해를 입히고, 자신을 치유하며, 잠시 동안 bonus move speed가 부여됩니다.',
    slot: 'weapon',
    tier: 3
  },
  { id: 4075861416, ko: '영혼 강탈', desc: '', slot: 'weapon', tier: 3 },
  {
    id: 3884003354,
    ko: '약화 헤드샷',
    desc: '헤드샷 명중 시 대상의 총탄, 마법 저항, 받는 치유량이 감소합니다.',
    slot: 'weapon',
    tier: 4
  },
  { id: 395867183, ko: '신비탄', desc: '다음 총탄이 보너스 마법 피해를 입힙니다.', slot: 'weapon', tier: 2 },
  {
    id: 1396247347,
    ko: '행운탄',
    desc: '일정 확률로 총탄이 강화되어 적중 시 보너스 무기 피해를 입힙니다.보너스 피해로 치명타를 입힐 수 없습니다.',
    slot: 'weapon',
    tier: 4
  },
  {
    id: 2095565695,
    ko: '초근접 사격',
    desc: '근거리에 있는 대상에 추가 무기 피해를 입히고 대상이 총탄에 맞으면 이동 속도 둔화 효과가 적용됩니다.',
    slot: 'weapon',
    tier: 3
  },
  {
    id: 3696726732,
    ko: '독성탄',
    desc: '대상이 총탄에 맞으면 독성이 축적됩니다. 축적이 완료되면 최대 체력의 일정 비율로 출혈 피해를 입힙니다. 출혈 피해를 입은 대상은 받는 치유량도 감소됩니다.',
    slot: 'weapon',
    tier: 3
  },
  {
    id: 2480592370,
    ko: '도탄',
    desc: '대상이 총탄에 맞으면 근처 적군에게 총탄이 튕기고 모든 확률 기반 총탄 효과가 적용되며 기본 피해의 일정 비율로 피해를 입힙니다.',
    slot: 'weapon',
    tier: 4
  },
  { id: 3633614685, ko: '추가 체력', desc: '', slot: 'vitality', tier: 1 },
  { id: 499683006, ko: '총탄 체력 흡수', desc: '', slot: 'vitality', tier: 2 },
  {
    id: 1047818222,
    ko: '약화 감소',
    desc: '자신에게 적용된 모든 부정적인 효과의 지속 시간이 감소합니다.',
    slot: 'vitality',
    tier: 2
  },
  { id: 3731635960, ko: '마법 해제', desc: '', slot: 'vitality', tier: 3 },
  {
    id: 2163598980,
    ko: '마법 저항',
    desc: '체력이 50% 미만으로 내려가면 추가 마법 저항을 얻습니다.',
    slot: 'vitality',
    tier: 3
  },
  {
    id: 3140772621,
    ko: '총탄 저항',
    desc: '체력이 50% 미만으로 내려가면 추가 총탄 저항을 추가로 얻습니다.',
    slot: 'vitality',
    tier: 3
  },
  { id: 1378931225, ko: '강철 피부', desc: '총탄에 면역이 됩니다.', slot: 'vitality', tier: 3 },
  { id: 2566692615, ko: '치유 부스터', desc: '플레이어의 치유 효과가 증가합니다.', slot: 'vitality', tier: 2 },
  {
    id: 3585132399,
    ko: '불사의 정신',
    desc: '일정 시간 동안 피해를 입지 않으면 체력 재생을 얻습니다.',
    slot: 'vitality',
    tier: 3
  },
  { id: 865846625, ko: '거머리', desc: '적군이 적용한 치유 감소 효과가 감소합니다.', slot: 'vitality', tier: 4 },
  { id: 3399065363, ko: '쾌속 장화', desc: '', slot: 'vitality', tier: 1 },
  {
    id: 3074274290,
    ko: '전리품 수집가',
    desc: '도움 또는 처치를 기록할 때마다 추가 질주, 능력 범위 및 지속 영혼 생성을 추가로 얻습니다. 이 효과는 중첩되며 사망 후에도 유지됩니다.',
    slot: 'vitality',
    tier: 2
  },
  {
    id: 2447176615,
    ko: '쾌속 질주',
    desc: '자신에게 적용된 이동 속도 페널티가 감소합니다.',
    slot: 'vitality',
    tier: 2
  },
  { id: 334300056, ko: '활력의 대가', desc: '', slot: 'vitality', tier: 3 },
  { id: 668299740, ko: '급속탄', desc: '', slot: 'weapon', tier: 1 },
  { id: 4139877411, ko: '추가 활력', desc: '', slot: 'vitality', tier: 1 },
  {
    id: 2481177645,
    ko: '헌터의 오라',
    desc: '근처 적군의 총탄 저항 및 연사 속도가 감소합니다. 근처에 적군 영웅이 단 한 명만 있으면 효과가 2배로 증가합니다.',
    slot: 'weapon',
    tier: 3
  },
  { id: 1672893796, ko: '근성', desc: '짧은 시간 동안 방벽을 획득합니다.', slot: 'vitality', tier: 1 },
  {
    id: 805079544,
    ko: '무기 차폐',
    desc: '짧은 제한 시간 내에 적 영웅으로부터 상당한 무기 피해를 입을 때마다 방벽을 얻습니다.',
    slot: 'vitality',
    tier: 2
  },
  {
    id: 112198670,
    ko: '마법 차폐',
    desc: '짧은 제한 시간 내에 적 영웅으로부터 상당한 마법 피해를 입을 때마다 방벽을 얻습니다.',
    slot: 'vitality',
    tier: 2
  },
  {
    id: 1235347618,
    ko: '전투 조끼',
    desc: '체력이 65% 이상이면 무기 피해 및 보너스 연사 속도를 얻습니다.',
    slot: 'vitality',
    tier: 2
  },
  {
    id: 3970837787,
    ko: '마법사의 문장',
    desc: '체력이 65% 이상이면 보너스 마력 및 쿨다운 감소를 얻습니다.',
    slot: 'vitality',
    tier: 2
  },
  { id: 968099481, ko: '추가 마법', desc: '', slot: 'spirit', tier: 1 },
  {
    id: 1439347412,
    ko: '신비의 회복',
    desc: '적군 영웅에게 마법 피해를 입히면 보너스 재생을 얻습니다. 다른 영웅에게 피해를 입히면 중첩됩니다.',
    slot: 'spirit',
    tier: 1
  },
  { id: 7409189, ko: '마법 강화', desc: '', slot: 'spirit', tier: 2 },
  {
    id: 2226497419,
    ko: '영혼의 너울',
    desc: '영웅이 총탄에 맞으면 강화 효과가 축적됩니다. 축적이 완료되면 보너스 연사 속도, 마력, 마법 체력 흡수를 얻습니다.',
    slot: 'weapon',
    tier: 4
  },
  {
    id: 3361075077,
    ko: '보복 사격',
    desc: '적군이 능력 또는 무기로 공격하여 자신이 피해를 입으면 자동으로 해당 적군에게 총탄을 발사합니다.',
    slot: 'vitality',
    tier: 2
  },
  { id: 1193964439, ko: '대확장', desc: '능력과 아이템의 범위 및 효과 반경이 증가합니다.', slot: 'spirit', tier: 3 },
  { id: 754480263, ko: '신비의 확장', desc: '능력을 보강해 범위와 효과 반경을 넓힙니다.', slot: 'spirit', tier: 1 },
  { id: 3776945997, ko: '추가 충전', desc: '', slot: 'spirit', tier: 1 },
  { id: 876563814, ko: '마법 체력 흡수', desc: '', slot: 'vitality', tier: 2 },
  {
    id: 2971868509,
    ko: '총탄 저항 분쇄',
    desc: '마법 피해를 입히면 적군의 총탄 저항이 감소합니다.',
    slot: 'spirit',
    tier: 2
  },
  { id: 3577481646, ko: '신비의 반향', desc: '', slot: 'spirit', tier: 4 },
  {
    id: 1998374645,
    ko: '신비의 폭발',
    desc: '시간이 지남에 따라 충전되며 보너스 마법 피해를 얻고, 80 이상의 피해를 입히는 능력이 추가 피해를 입힙니다.',
    slot: 'spirit',
    tier: 1
  },
  {
    id: 2121044373,
    ko: '탱크버스터',
    desc: '시간이 지남에 따라 충전되며 보너스 마법 피해를 얻고, 165 이상의 피해를 입히는 능력이 추가 피해를 입힙니다. 마법 저항을 무시합니다.',
    slot: 'spirit',
    tier: 3
  },
  {
    id: 2081037738,
    ko: '신비의 상처',
    desc: '적이 마법 피해를 입을 때, 해당 적군의 마법 저항이 감소합니다.',
    slot: 'spirit',
    tier: 2
  },
  {
    id: 2603935618,
    ko: '치유 억제',
    desc: '내 마법 피해가 적군의 받는 치유량을 감소시킵니다. 이 효과가 적용된 적군 영웅이 사망하면 자신의 체력이 크게 치유됩니다.',
    slot: 'vitality',
    tier: 2
  },
  {
    id: 1102081447,
    ko: '신비의 둔화',
    desc: '대상이 마법 피해를 입으면 이동 속도가 감소합니다.',
    slot: 'spirit',
    tier: 2
  },
  {
    id: 3005970438,
    ko: '마법 증폭 중첩',
    desc: '마법 피해를 입히면 대상에 중첩되는 마법 증폭이 적용되어 플레이어가 대상에 입히는 마법 피해가 증가합니다.',
    slot: 'spirit',
    tier: 4
  },
  { id: 787198704, ko: '급속 재충전', desc: '', slot: 'spirit', tier: 3 },
  {
    id: 424779525,
    ko: '만능충전 인장',
    desc: '활성 상태의 비궁극기 능력을 보강해 보너스 능력 충전을 부여합니다. 이미 충전된 능력은 더 많은 보너스 충전을 받습니다.',
    slot: 'spirit',
    tier: 5
  },
  { id: 380806748, ko: '쿨다운 압축', desc: '능력을 보강해 쿨다운을 단축합니다.', slot: 'spirit', tier: 2 },
  { id: 3261353684, ko: '절대 쿨다운', desc: '능력의 쿨다운이 감소합니다.', slot: 'spirit', tier: 3 },
  { id: 915014646, ko: '초월 쿨다운', desc: '능력과 아이템의 쿨다운이 감소합니다.', slot: 'spirit', tier: 4 },
  {
    id: 1813726886,
    ko: '둔화 주술',
    desc: '대상 적군의 이동 속도를 둔화합니다. 또한 대상의 이동 기반 아이템과 능력에 침묵을 적용합니다.대상의 중력을 증가시킵니다.대상의 활력 사용에는 영향을 미치지 않습니다.',
    slot: 'spirit',
    tier: 2
  },
  { id: 1219329868, ko: '영혼 채취', desc: '대상 적군의 마법 저항력 및 마력을 감소시킵니다.', slot: 'spirit', tier: 2 },
  {
    id: 2142980412,
    ko: '포커스 렌즈',
    desc: '대상 적군에게 침묵을 적용합니다. 침묵이 종료된 후, 침묵 중에 입힌 전체 피해량 중 일정량이 대상에게 적용됩니다.',
    slot: 'spirit',
    tier: 4
  },
  {
    id: 2922054143,
    ko: '녹슨 총신',
    desc: '대상 적군의 연사 속도와 총탄 저항을 감소시킵니다.',
    slot: 'spirit',
    tier: 1
  },
  {
    id: 2061878743,
    ko: '무장 해제 주술',
    desc: '대상 적군을 무장 해제시키고 총탄 저항을 감소시킵니다.',
    slot: 'spirit',
    tier: 3
  },
  {
    id: 1804594021,
    ko: '구호 광선',
    desc: '대상 아군 영웅과 자신을 최대 체력의 일정 비율로 치유합니다. 치유 중에 한 번 대상을 자신 쪽으로 끌어당길 수 있습니다. 자신에게 시전할 수 있습니다.',
    slot: 'vitality',
    tier: 3
  },
  {
    id: 3144988365,
    ko: '부패',
    desc: '대상의 현재 체력에 비례하여 지속 피해를 입힙니다.부패 피해로는 적군을 처치할 수 없으며 아이템 효과가 가중되지 않습니다.',
    slot: 'spirit',
    tier: 3
  },
  {
    id: 2417568017,
    ko: '재앙',
    desc: '아군 대상에게 마법 저항, 약화 저항을 부여하고, 적군의 최대 체력에 비례하여 피해를 입히는 오라를 부여합니다. 대상에 걸려 있던 약화는 감소합니다.자신에게 시전할 수 있습니다.',
    slot: 'spirit',
    tier: 4
  },
  {
    id: 1254091416,
    ko: '충격의 모루',
    desc: '2초 후 기절을 적용합니다. 공중에 뜬 적군에게는 기절 지속 시간이 증가합니다.기절 지속 시간 동안 대상의 중력이 증가합니다',
    slot: 'spirit',
    tier: 3
  },
  {
    id: 1371725689,
    ko: '유령 타격',
    desc: '대상 적에게 순간이동하고 지면으로 끌어당깁니다. 피해를 입히고, 이동 속도를 감소시키며, 무장 해제됩니다.',
    slot: 'vitality',
    tier: 4
  },
  { id: 3270001687, ko: '시공의 돌', desc: '전방으로 순간이동하고 총탄 저항을 얻습니다.', slot: 'vitality', tier: 3 },
  { id: 1152158042, ko: '소용돌이 거미줄', desc: '', slot: 'spirit', tier: 4 },
  {
    id: 677738769,
    ko: '복원의 빛',
    desc: '모든 능력의 쿨다운이 초기화되고 모든 충전이 복원됩니다.',
    slot: 'spirit',
    tier: 4
  },
  { id: 630839635, ko: '공명의 파편', desc: '', slot: 'spirit', tier: 4 },
  {
    id: 395944548,
    ko: '고통의 파동',
    desc: '가장 가까이 있는 적군 2명에게 주기적으로 마법 피해를 입힙니다.',
    slot: 'spirit',
    tier: 3
  },
  { id: 3361811174, ko: '죽음 속이기', desc: '', slot: 'vitality', tier: 4 },
  {
    id: 1798666702,
    ko: '그림자 장막',
    desc: '은신 상태가 됩니다. 은신 상태에서 피해를 입으면 짧은 시간 동안 모습이 노출됩니다.',
    slot: 'weapon',
    tier: 3
  },
  {
    id: 600033864,
    ko: '용맹의 도약',
    desc: '공중으로 높이 날아올라 자신에게 방벽을 부여합니다. 공중에 떠 있을 때 능력을 다시 사용하여 빠르게 낙하할 수 있습니다.적군 영웅에게 공격을 받으면 5초 동안 사용할 수 없습니다.',
    slot: 'vitality',
    tier: 3
  },
  { id: 2956256701, ko: '치유의 빛', desc: '자신과 주변 아군을 치유합니다.', slot: 'vitality', tier: 3 },
  { id: 2059712766, ko: '회복 목걸이', desc: '', slot: 'vitality', tier: 2 },
  {
    id: 1710079648,
    ko: '치유 의식',
    desc: '대상에 재생 및 질주 속도가 부여됩니다. 적군 영웅이나 주요 목표물의 공격으로 피해를 입으면 효과가 중단됩니다. 자신에게 시전할 수 있습니다.',
    slot: 'vitality',
    tier: 1
  },
  {
    id: 4121584236,
    ko: '축소 광선',
    desc: '대상의 모델 사이즈를 줄이고 이동 속도를 부여합니다. 이 모드에서는 터널을 이용할 수 있습니다. 자신에게 시전할 수 있습니다.',
    slot: 'spirit',
    tier: 5
  },
  { id: 1797283378, ko: '신비의 숨결', desc: '마법 체력 흡수 및 마력을 얻습니다.', slot: 'vitality', tier: 4 },
  {
    id: 857669956,
    ko: '수호 결계',
    desc: '대상에게 방벽 및 일시적인 이동 속도를 부여합니다. 자신에게 시전할 수 있습니다.자신이 아닌 대상에게 시전하면 쿨다운이 절반으로 감소합니다.',
    slot: 'vitality',
    tier: 2
  },
  {
    id: 1662311306,
    ko: '수호 방벽',
    desc: '대상으로부터 기절을 제외한 모든 약화 효과를 제거하고 방벽 및 이동 속도를 부여합니다. 자신에게 시전할 수 있습니다. 자신이 아닌 대상에게 시전하면 쿨다운이 절반으로 감소합니다.',
    slot: 'vitality',
    tier: 4
  },
  {
    id: 1932939246,
    ko: '화염 연금술',
    desc: '접촉 시 폭발하는 플라스크를 투척합니다. 폭발 반경 내에 있는 적군에게 점차 증가하는 초당 마법 피해를 입히고 적군의 총탄 저항을 감소시킵니다.비영웅 대상 시 효과가 50% 감소합니다.',
    slot: 'weapon',
    tier: 3
  },
  {
    id: 989206714,
    ko: '피의 공물',
    desc: '전환: 지속적으로 체력을 희생시켜 연사 속도, 약화 효과 저항 및 이동 속도를 높입니다.',
    slot: 'weapon',
    tier: 3
  },
  { id: 3403085434, ko: '민첩 걸음', desc: '', slot: 'weapon', tier: 2 },
  {
    id: 3977876567,
    ko: '반응성 대시',
    desc: '대시 점프 시 다음 재장전까지 연사 속도와 보너스 탄약을 얻습니다. 최대 7초 동안 지속됩니다.',
    slot: 'weapon',
    tier: 2
  },
  {
    id: 1150006784,
    ko: '신비의 확산',
    desc: '대시 점프 후 7초 내에 사용하는 다음 능력에 범위, 지속 시간, 마력 보너스가 적용됩니다.',
    slot: 'spirit',
    tier: 2
  },
  {
    id: 3357231760,
    ko: '절대 저항',
    desc: '일시적으로 부정적 상태 효과를 억제하고 기절, 침묵, 수면, 이동 불가, 무장 해제 효과에 면역이 됩니다.기절 또는 수면 상태에서는 사용할 수 없습니다.',
    slot: 'vitality',
    tier: 4
  },
  {
    id: 2407781327,
    ko: '거인',
    desc: '몸의 크기가 커지고, 총탄 저항, 마법 저항, 근거리 공격 피해을 얻습니다. 근처의 적군은 둔화 효과에 걸리고 대시 속도가 감소합니다.',
    slot: 'vitality',
    tier: 4
  },
  {
    id: 1976391348,
    ko: '얼음 전선',
    desc: '확장하는 얼음 폭풍을 시전하여 적중한 대상에 마법 피해를 입히고 둔화를 적용합니다.',
    slot: 'spirit',
    tier: 2
  },
  {
    id: 3812615317,
    ko: '극지 돌풍',
    desc: '확장하는 얼음 폭풍을 발사하여 타격하는 대상에게 마법 피해를 입히고, 대상을 동결시킨 후 둔화 효과를 부여합니다.둔화된 대상은 활력 재생이 동결됩니다.',
    slot: 'spirit',
    tier: 4
  },
  {
    id: 2533252781,
    ko: '공허의 화신',
    desc: '즉시 공허 상태에 진입하여 짧은 시간 동안 무적 상태가 됩니다.',
    slot: 'spirit',
    tier: 4
  },
  {
    id: 2617435668,
    ko: '저주받은 유물',
    desc: '적을 저주하여 방해하고, 침묵시키고, 무장 해제시키고, 아이템 사용을 차단합니다. 궁극기가 아닌 버프를 모두 제거합니다.지속 시간 동안 플레이어의 피해량이 감소합니다.',
    slot: 'spirit',
    tier: 4
  },
  { id: 2951612397, ko: '지속 시간 연장', desc: '능력을 보강해 지속 시간을 늘립니다.', slot: 'spirit', tier: 2 },
  { id: 2717651715, ko: '절대 지속', desc: '능력과 아이템의 지속 시간이 증가합니다.', slot: 'spirit', tier: 3 },
  {
    id: 365620721,
    ko: '유리 대포',
    desc: '영웅을 처치할 때마다 영구적으로 발사 속도를 얻습니다. 최대 8회까지 중첩되며 사망 시 중첩 1회를 잃습니다.',
    slot: 'weapon',
    tier: 4
  },
  { id: 1409190604, ko: '격노 각성', desc: '', slot: 'vitality', tier: 3 },
  { id: 1055679805, ko: '불멸의 기세', desc: '', slot: 'vitality', tier: 4 },
  {
    id: 1252627263,
    ko: '생명 강타',
    desc: '근거리 공격 시 대상에 이동 속도 둔화 효과를 적용하고 대상에 입히는 근거리 피해의 일정 비율과 고정된 수치의 총합만큼 자신을 치유합니다. 비영웅 상대 시 전체 치유량의 40%를 치유합니다. 약한 근거리 공격이 적중하면 쿨다운이 1.5배로 증가합니다.',
    slot: 'vitality',
    tier: 3
  },
  {
    id: 465043967,
    ko: '마법 강타',
    desc: '영웅을 대상으로 약한 근거리 공격 또는 강한 근거리 공격을 가하면 추가 마법 피해를 입히고 대상의 마법 저항력을 감소시킵니다.약한 근거리 공격이 적중하면 쿨다운이 2배로 증가합니다.',
    slot: 'spirit',
    tier: 1
  },
  {
    id: 3190916303,
    ko: '마법 손아귀',
    desc: '영웅을 대상으로 약한 근거리 공격 또는 강한 근거리 공격을 가하면, 공격이 추가 마법 피해를 입히고 대상의 마법 저항력과 마력을 훔칩니다.약한 근거리 공격이 적중하면 효과가 30% 감소합니다.',
    slot: 'spirit',
    tier: 3
  },
  {
    id: 26002154,
    ko: '근거리 돌격',
    desc: '적군을 대상으로 하는 다음 강한 근거리 공격의 입히는 피해가 증가합니다.',
    slot: 'weapon',
    tier: 2
  },
  {
    id: 800008313,
    ko: '분쇄 주먹',
    desc: '근거리 공격 피해을 가하면 탄약을 회복하고 적군에게 중첩되는 총탄 저항 약화 효과를 적용합니다. 강한 근거리 공격을 가할 경우 2회 중첩됩니다.최대 중첩에 도달하면 대상이 기절합니다.',
    slot: 'weapon',
    tier: 4
  },
  {
    id: 2820116164,
    ko: '예언자의 방탄복',
    desc: '궁극기 시전 시 방벽을 얻고 일시적으로 마력을 얻습니다.',
    slot: 'vitality',
    tier: 4
  },
  {
    id: 2947183272,
    ko: '찬란한 회복',
    desc: '능력을 시전할 때 자신을 치유하고 짧은 시간 동안 보너스 이동 속도를 얻습니다.',
    slot: 'spirit',
    tier: 3
  },
  { id: 2519598785, ko: '영혼의 해방', desc: '', slot: 'spirit', tier: 4 },
  {
    id: 2739107182,
    ko: '급속 사격',
    desc: '총탄이 1발이라도 영웅에게 적중하면 잠시 동안 연사 속도와 이동 속도가 증가합니다.',
    slot: 'weapon',
    tier: 3
  },
  { id: 2829638276, ko: '추가 재생', desc: '', slot: 'vitality', tier: 1 },
  {
    id: 1292979587,
    ko: '격동의 기세',
    desc: '영구적으로 마력을 부여하여 능력을 보강합니다. 해당 능력을 사용하면 보너스 이동 속도를 얻고 공격 중에도 최대 속도를 유지합니다.',
    slot: 'spirit',
    tier: 3
  },
  {
    id: 1925087134,
    ko: '억제',
    desc: '적군에게 마법 피해를 입히면 적군의 연사 속도가 감소합니다.',
    slot: 'spirit',
    tier: 2
  },
  {
    id: 84321454,
    ko: '즉시 재장전',
    desc: '보강된 능력이 시간이 지남에 따라 충전되며 보너스 마법 피해, 보너스 연사 속도 효과를 얻고, 사용 시 총탄을 재장전합니다.',
    slot: 'spirit',
    tier: 2
  },
  {
    id: 3919289022,
    ko: '수은 매그넘',
    desc: '보강된 능력이 시간이 지남에 따라 충전되며 보너스 마법 피해, 보너스 연사 속도 효과를 얻고, 사용 시 총탄을 재장전합니다. 다음 재장전까지 마력에 비례하여 총탄이 보너스 마법 피해를 입힙니다.',
    slot: 'spirit',
    tier: 4
  },
  { id: 2407033488, ko: '강화 탄창', desc: '무기를 연사할수록 무기 피해가 증가합니다.', slot: 'weapon', tier: 2 },
  {
    id: 2463960640,
    ko: '저항 증대',
    desc: '영웅에게 총탄 피해를 입히면 총탄 저항이 부여됩니다. 각 총탄은 중첩 1회에 해당하는 총탄 저항만 부여합니다.',
    slot: 'weapon',
    tier: 3
  },
  { id: 4104549924, ko: '고속 연사', desc: '', slot: 'weapon', tier: 2 },
  {
    id: 865958998,
    ko: '장막 걸음',
    desc: '우주 장막을 통과하여 걸으면 은신 상태가 되고 치유되며 이동 속도가 증가합니다.',
    slot: 'vitality',
    tier: 3
  },
  {
    id: 1644605047,
    ko: '반응성 방벽',
    desc: '기절, 속박, 이동 불가, 수면 또는 침묵에 걸리면 방벽을 획득합니다.',
    slot: 'vitality',
    tier: 2
  },
  { id: 951866250, ko: '진압 불가', desc: '', slot: 'vitality', tier: 4 },
  { id: 3862866912, ko: '회복탄', desc: '다음 총탄이 적중한 대상에 따라 자신을 치유합니다.', slot: 'weapon', tier: 1 },
  { id: 2356412290, ko: '대형 탄창', desc: '', slot: 'weapon', tier: 2 },
  {
    id: 3647584222,
    ko: '분할탄',
    desc: '무기에 다중 사격 효과가 부여됩니다. 1회 공격이 둘 이상의 영웅에 적중하면 무기 피해 보너스가 중첩됩니다. 한 번의 다중 사격은 한 대상에게 2회 이상 적중할 수 없습니다.',
    slot: 'weapon',
    tier: 2
  },
  {
    id: 381961617,
    ko: '급속 재장전',
    desc: '장전 중 급속 재장전 구간에서 재장전 키를 누르면 재장전이 즉시 완료되고 연사 속도, 총탄 체력 흡수, 이동 속도가 부여됩니다.',
    slot: 'weapon',
    tier: 2
  },
  {
    id: 2800629741,
    ko: '마법 양탄자',
    desc: '마법 양탄자를 소환해 비행합니다. 비행 중에는 둔화 효과에 면역이 되지만, 동작을 취하면 양탄자가 사라집니다. 양탄자 소환된 동안에는 능력을 사용할 수 없습니다.',
    slot: 'spirit',
    tier: 4
  },
  {
    id: 343572757,
    ko: '영혼 화상',
    desc: '5초 내에 적군에게 상당한 마법 피해를 입히면 폭발을 일으켜 해당 적군에게 피해를 입히고 화상을 적용합니다. 화상 상태인 적군은 지속 피해를 입으며 받는 치유량이 감소합니다.쿨다운은 적마다 따로 적용되므로, 각 대상은 쿨다운 한 번당 한 번만 화상을 입을 수 있습니다. 비영웅 대상에게는 절반의 피해만 입힙니다.',
    slot: 'spirit',
    tier: 4
  },
  {
    id: 493591231,
    ko: '섬광의 고서',
    desc: '궁극기로 피해를 입히면, 잠시 후 기절 효과를 적용하고 보너스 마법 피해를 입힙니다.',
    slot: 'spirit',
    tier: 4
  },
  {
    id: 3028234315,
    ko: '마력 사슬 갑옷',
    desc: '적에게 강한 마법 피해를 입으면 무작위 능력의 재사용 대기시간이 감소합니다.',
    slot: 'vitality',
    tier: 4
  },
  {
    id: 1427630806,
    ko: '치유 리듬',
    desc: '자신 또는 아군을 치유하면 대상에게 보너스 연사 속도 및 bonus move speed를 부여합니다.자체 재생 또는 자체 총탄/마법 체력 흡수에는 적용되지 않습니다.',
    slot: 'vitality',
    tier: 4
  },
  {
    id: 673001892,
    ko: '방어 관통',
    desc: '일정 확률로 피할 수 없는 총탄을 발사합니다. 이 총탄은 적을 관통하고 총탄 저항을 무시합니다.',
    slot: 'weapon',
    tier: 4
  },
  { id: 3269957497, ko: '무한탄', desc: '탄약이 무한이 됩니다.', slot: 'weapon', tier: 5 },
  {
    id: 3491236900,
    ko: '판금 갑옷',
    desc: '일정 확률로 날아오는 총탄을 튕겨내어 모든 무기 피해를 차단하거나 총탄으로 인한 모든 적중 시 효과를 차단합니다.',
    slot: 'vitality',
    tier: 4
  },
  {
    id: 1955841979,
    ko: '마법 차단',
    desc: '다음에 큰 마법 피해를 입는 경우, 해당 피해가 크게 감소합니다.',
    slot: 'vitality',
    tier: 4
  },
  { id: 1250307611, ko: '저거노트', desc: '', slot: 'vitality', tier: 4 },
  {
    id: 2221211450,
    ko: '주문 난사',
    desc: '전투 중에 능력을 시전하거나 아이템을 사용할 때마다 발사 속도와 재장전 속도를 향상시키는 중첩 강화 효과를 얻습니다. 효과가 중첩될 때마다 지속 시간이 초기화됩니다.',
    slot: 'weapon',
    tier: 4
  },
  {
    id: 98582110,
    ko: '추격자',
    desc: '근거리에서 무기 피해를 입히면 상처를 내고, bonus move speed를 얻습니다. 상처가 생긴 적은 지속 마법 피해를 입고, 총탄 저항이 감소하며, 벽 너머로 노출됩니다.',
    slot: 'weapon',
    tier: 2
  },
  {
    id: 690458959,
    ko: '신속탄',
    desc: '다음 공격이 빠르게 연속으로 두 번 발사되며, 피해 및 탄속이 증가합니다. 이 공격은 추가 탄약을 소모합니다.',
    slot: 'weapon',
    tier: 3
  },
  {
    id: 1736094134,
    ko: '세라핌의 날개',
    desc: '공중에 떠 있는 상태에서 입히는 피해가 증가하고, 입는 피해가 감소합니다. 공중 대시 및 점프를 무제한으로 할 수 있습니다.',
    slot: 'vitality',
    tier: 5
  },
  {
    id: 2054088113,
    ko: '신비한 피아노',
    desc: '짧은 지연 시간 후 대상 영역에 있는 적들은 기절하고 활력이 고갈됩니다. 기절 상태가 끝나면 일시적으로 멍해짐 상태가 됩니다.',
    slot: 'spirit',
    tier: 5
  },
  {
    id: 3949773228,
    ko: '무효화 오라',
    desc: '적군의 강화 효과를 제거하고 활력 사용과 치유를 차단합니다.',
    slot: 'vitality',
    tier: 5
  },
  {
    id: 3729138568,
    ko: '천상의 축복',
    desc: '매우 강력한 정화 효과를 부여해 모든 아군을 회복시킵니다.',
    slot: 'vitality',
    tier: 5
  },
  {
    id: 230297145,
    ko: '영원의 선물',
    desc: '주기적으로 무작위 영구 능력치 강화 효과를 얻습니다.',
    slot: 'vitality',
    tier: 5
  },
  {
    id: 4050602737,
    ko: '신비의 도관',
    desc: '자신과 아군에게 강력한 마법 집중 오라를 부여합니다. 아군에게는 효과가 감소합니다.',
    slot: 'spirit',
    tier: 5
  },
  {
    id: 3568217437,
    ko: '섬뜩한 사격',
    desc: '다음 총탄이 적군의 피해량, 치유량, 이동 속도를 감소시키는 강력한 약화 효과를 부여합니다. 또한 대상의 현재 체력에 비례한 보너스 마법 피해를 입힙니다.총탄이 커지고 대상을 관통합니다.',
    slot: 'weapon',
    tier: 5
  },
  {
    id: 3523480953,
    ko: '기회의 망토',
    desc: '이동 제한, 기절, 속박, 이동 불가, 또는 수면 상태를 부여하는 다음 약화 효과를 막고, 절대 저항 상태가 됩니다. 또한 방벽과 보너스 이동 속도를 얻습니다.',
    slot: 'vitality',
    tier: 5
  },
  {
    id: 64550694,
    ko: '룬 건틀렛',
    desc: '강한 근거리 공격을 적중시킬 때마다, 적용 중인 쿨다운이 감소합니다.',
    slot: 'weapon',
    tier: 5
  },
  {
    id: 1825399334,
    ko: '전기 슬리퍼',
    desc: '활주 시 총탄을 회피하고, 연사 속도가 증가하며, 근처 적에게 피해를 입힙니다. 대상마다 개별 쿨다운이 적용됩니다.',
    slot: 'vitality',
    tier: 5
  },
  {
    id: 1132564516,
    ko: '프리즘 폭발',
    desc: '잠시 동안 공허 상태가 되어 대상 지정 불가 및 무적 상태가 됩니다. 그 시간 동안 플레이어 주위를 회전하는 레이저를 발사합니다.',
    slot: 'spirit',
    tier: 5
  },
  {
    id: 1558545403,
    ko: '불안정 혼합물',
    desc: '절대 저항을 제공하고 속도, 체력, 마법 및 무기 피해를 증가시키는 혼합물을 섭취합니다. 잠시 후에 사망하고 폭발하며, 근처 적군을 기절시키고 플레이어의 최대 체력에 비례하는 피해를 입힙니다. 이렇게 사망하면 부활 시간이 50% 감소합니다.',
    slot: 'spirit',
    tier: 5
  },
  {
    id: 2068250483,
    ko: '동상 부적',
    desc: '보강된 능력의 쿨다운이 감소하고 마력이 증가합니다. 해당 능력으로 피해를 입히면, 대상을 얼리고 보너스 피해를 입힙니다. 대상마다 개별 쿨다운이 적용됩니다.',
    slot: 'spirit',
    tier: 5
  },
  {
    id: 2319629810,
    ko: '암습',
    desc: '활력을 사용하면 감지 범위가 없는 투명 상태가 됩니다. 투명 상태에서 근거리 공격을 가하면 대상의 총탄 및 마법 저항을 강탈하고 지속 피해를 입힙니다.',
    slot: 'vitality',
    tier: 5
  },
  {
    id: 3294954488,
    ko: '폭발 강화',
    desc: '능력을 보강해 범위를 증가시킵니다. 해당 능력으로 피해를 입히면 개별 영웅에 적중할 때마다 무기 피해가 증가합니다. 비영웅에게는 효과가 감소합니다.',
    slot: 'weapon',
    tier: 3
  },
  {
    id: 1763073141,
    ko: '재충전 러시',
    desc: '상당량의 무기 피해를 입히면 플레이어가 보유한 충전 능력이 1회 충전됩니다.',
    slot: 'weapon',
    tier: 2
  },
  {
    id: 2462046703,
    ko: '황금 거위알',
    desc: '살아 있는 동안, 시간이 지남에 따라 영혼을 얻습니다.',
    slot: 'spirit',
    tier: 1
  }
];
